# Création de tables et enrégistrements

In [2]:
%reload_ext sql
%sql postgresql://user_tp:ue_bd_ihm_db@localhost/ue_bd_ihm_db

'Connected: user_tp@ue_bd_ihm_db'

## Effacement des tables

In [261]:
%%sql
DROP TABLE if exists compte CASCADE;
DROP TABLE if exists membre CASCADE;
DROP TABLE if exists depense CASCADE;
DROP TABLE if exists commentaire CASCADE;
DROP TABLE if exists smiley CASCADE;
DROP TABLE if exists reaction CASCADE;
DROP TABLE if exists appartenance CASCADE;
DROP TABLE if exists remboursement CASCADE;
DROP TABLE if exists utilisation CASCADE;
DROP TABLE if exists categorie CASCADE;

 * postgresql://user_tp:***@localhost/ue_bd_ihm_db
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.

[]

## Création des tables

In [262]:
%%sql
CREATE TABLE appartenance (
    compte_id INTEGER NOT NULL,
    membre_id INTEGER NOT NULL
);

ALTER TABLE appartenance ADD CONSTRAINT appartenance_pk PRIMARY KEY ( compte_id,
                                                                      membre_id );

CREATE TABLE categorie (
    nom VARCHAR(100) NOT NULL
);

ALTER TABLE categorie ADD CONSTRAINT categorie_pk PRIMARY KEY ( nom );

CREATE TABLE commentaire (
    id                INTEGER NOT NULL,
    "date"            DATE,
    message           VARCHAR(160),
    membre_id         INTEGER NOT NULL,
    depense_id        INTEGER NOT NULL,
    depense_membre_id INTEGER NOT NULL,
    depense_compte_id INTEGER NOT NULL
);

ALTER TABLE commentaire
    ADD CONSTRAINT commentaire_pk PRIMARY KEY ( id,
                                                membre_id,
                                                depense_id,
                                                depense_membre_id,
                                                depense_compte_id );

CREATE TABLE compte (
    id  INTEGER NOT NULL,
    nom VARCHAR(255)
);

ALTER TABLE compte ADD CONSTRAINT compte_pk PRIMARY KEY ( id );

CREATE TABLE depense (
    id            INTEGER NOT NULL,
    montant       INTEGER,
    "date"        DATE,
    membre_id     INTEGER NOT NULL,
    compte_id     INTEGER NOT NULL,
    categorie_nom VARCHAR(100) NOT NULL
);

ALTER TABLE depense
    ADD CONSTRAINT depense_pk PRIMARY KEY ( id,
                                            membre_id,
                                            compte_id );

CREATE TABLE membre (
    id    INTEGER NOT NULL,
    nom   VARCHAR(20),
    email VARCHAR(100)
);

ALTER TABLE membre ADD CONSTRAINT membre_pk PRIMARY KEY ( id );

CREATE TABLE reaction (
    commentaire_id                INTEGER NOT NULL,
    commentaire_membre_id         INTEGER NOT NULL,
    smiley_url                    VARCHAR(255) NOT NULL,
    membre_id                     INTEGER NOT NULL,
    commentaire_depense_id        INTEGER NOT NULL,
    commentaire_depense_membre_id INTEGER NOT NULL,
    commentaire_depense_compte_id INTEGER NOT NULL
);

ALTER TABLE reaction
    ADD CONSTRAINT reaction_pk PRIMARY KEY ( commentaire_id,
                                             commentaire_membre_id,
                                             smiley_url,
                                             membre_id,
                                             commentaire_depense_id,
                                             commentaire_depense_membre_id,
                                             commentaire_depense_compte_id );

CREATE TABLE remboursement (
    membre_id         INTEGER NOT NULL,
    depense_id        INTEGER NOT NULL,
    depense_membre_id INTEGER NOT NULL,
    depense_compte_id INTEGER NOT NULL
);

ALTER TABLE remboursement
    ADD CONSTRAINT remboursement_pk PRIMARY KEY ( membre_id,
                                                  depense_id,
                                                  depense_membre_id,
                                                  depense_compte_id );

CREATE TABLE smiley (
    url VARCHAR(255) NOT NULL,
    nom VARCHAR(20)
);

ALTER TABLE smiley ADD CONSTRAINT smiley_pk PRIMARY KEY ( url );

ALTER TABLE appartenance
    ADD CONSTRAINT appartenance_compte_fk FOREIGN KEY ( compte_id )
        REFERENCES compte ( id );

ALTER TABLE appartenance
    ADD CONSTRAINT appartenance_membre_fk FOREIGN KEY ( membre_id )
        REFERENCES membre ( id );

ALTER TABLE commentaire
    ADD CONSTRAINT commentaire_depense_fk FOREIGN KEY ( depense_id,
                                                        depense_membre_id,
                                                        depense_compte_id )
        REFERENCES depense ( id,
                             membre_id,
                             compte_id );

ALTER TABLE commentaire
    ADD CONSTRAINT commentaire_membre_fk FOREIGN KEY ( membre_id )
        REFERENCES membre ( id );

ALTER TABLE depense
    ADD CONSTRAINT depense_categorie_fk FOREIGN KEY ( categorie_nom )
        REFERENCES categorie ( nom );

ALTER TABLE depense
    ADD CONSTRAINT depense_compte_fk FOREIGN KEY ( compte_id )
        REFERENCES compte ( id );

ALTER TABLE depense
    ADD CONSTRAINT depense_membre_fk FOREIGN KEY ( membre_id )
        REFERENCES membre ( id );

ALTER TABLE reaction
    ADD CONSTRAINT reaction_commentaire_fk FOREIGN KEY ( commentaire_id,
                                                         commentaire_membre_id,
                                                         commentaire_depense_id,
                                                         commentaire_depense_membre_id,
                                                         commentaire_depense_compte_id )
        REFERENCES commentaire ( id,
                                 membre_id,
                                 depense_id,
                                 depense_membre_id,
                                 depense_compte_id );

ALTER TABLE reaction
    ADD CONSTRAINT reaction_membre_fk FOREIGN KEY ( membre_id )
        REFERENCES membre ( id );

ALTER TABLE reaction
    ADD CONSTRAINT reaction_smiley_fk FOREIGN KEY ( smiley_url )
        REFERENCES smiley ( url );

ALTER TABLE remboursement
    ADD CONSTRAINT remboursement_depense_fk FOREIGN KEY ( depense_id,
                                                          depense_membre_id,
                                                          depense_compte_id )
        REFERENCES depense ( id,
                             membre_id,
                             compte_id );

ALTER TABLE remboursement
    ADD CONSTRAINT remboursement_membre_fk FOREIGN KEY ( membre_id )
        REFERENCES membre ( id );

 * postgresql://user_tp:***@localhost/ue_bd_ihm_db
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.

[]

## Peuplement

### Compte

In [263]:
%%sql
INSERT INTO compte VALUES (1,'leetchi');
insert into compte values (2,'Arnaque');
insert into compte values (3, 'Question pour un Champion');
insert into compte values (4,'Arnaque');
insert into compte values (5, 'Arnaque');
insert into compte values (6,'Medecin sans frontières');

 * postgresql://user_tp:***@localhost/ue_bd_ihm_db
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

#### Création d'enregistrements (avec python3)

\begin{verbatim}
pip install names
import names
import random
nombre=[k for k in range(100)]
nombre_melange=random.sample(nombre,len(nombre))
for i in range(20):
    nom=names.get_first_name()
    print("(", nombre_melange[i], ",","'"+nom+"'",",","'"+nom.lower()+"@"+domaine[random.randint(0,len(domaine)-1)]+"."+terminaison[random.randint(0,len(terminaison)-1)]+"'","),")
\end{verbatim}

### Membres

In [264]:
%%sql
INSERT INTO membre VALUES
( 1 , 'Elizabeth' , 'elizabeth@orange.edu' ),
( 2 , 'Patricia' , 'patricia@orange.edu' ),
( 3 , 'Debbie' , 'debbie@orange.en' ),
( 4 , 'Johnny' , 'johnny@orange.fr' ),
( 5 , 'Betty' , 'betty@orange.net' ),
( 6 , 'Gary' , 'gary@icloud.edu' ),
( 7 , 'Lillian' , 'lillian@icloud.en' ),
( 8 , 'Brian' , 'brian@msf.net' ),
( 9 , 'Joseph' , 'joseph@msf.edu' ),
( 10 , 'Julia' , 'julia@hotmail.edu' ),
( 11 , 'David' , 'david@gmail.en' ),
( 12 , 'Willie' , 'willie@imt-atlantique.net' ),
( 13 , 'Karen' , 'karen@imt-atlantique.en' ),
( 14 , 'Kenneth' , 'kenneth@example.fr' ),
( 15 , 'Robert' , 'robert@example.net' ),
( 16 , 'Francis' , 'francis@example.edu' ),
( 17 , 'John' , 'john@msf.com' ),
( 18 , 'John' , 'john@imt-atlantique.edu' ),
( 19 , 'Karen' , 'karen@msf.fr' ),
( 20 , 'Moses' , 'moses@hotmail.com' ),
( 21 , 'Hamid' , 'khalapoum71@gmail.com' ),
( 22 , 'Aziza' , 'khalapoum71@gmail.com' )

 * postgresql://user_tp:***@localhost/ue_bd_ihm_db
22 rows affected.

[]

### Appartenance

In [265]:
%%sql
insert into appartenance values
( 3 , 1 ),
( 1 , 2 ),
( 5 , 3 ),
( 5 , 4 ),
( 5 , 5 ),
( 2 , 6 ),
( 1 , 7 ),
( 5 , 8 ),
( 6 , 9 ),
( 1 , 10 ),
( 1 , 11 ),
( 5 , 12 ),
( 5 , 13 ),
( 5 , 14 ),
( 2 , 15 ),
( 4 , 16 ),
( 1 , 17 ),
( 6 , 18 ),
( 5 , 19 ),
( 6 , 20 ),
( 4 , 21 ),
( 1 , 22 ),
( 1 , 1 ),
( 3 , 2 ),
( 6 , 3 ),
( 6 , 4 ),
( 1 , 12 ),
( 3 , 13 ),
( 2 , 14 ),
( 6 , 15 );

 * postgresql://user_tp:***@localhost/ue_bd_ihm_db
30 rows affected.

[]

### Catégories

In [266]:
%%sql
insert into categorie values
('nourriture'), ('deplacement'), ('vêtement'), ('loyer'), ('Cadeaux');

 * postgresql://user_tp:***@localhost/ue_bd_ihm_db
5 rows affected.

[]

### Dépenses

In [267]:
%%sql
INSERT INTO depense VALUES
( 1 , 60 , TO_DATE( '01/11/2022' , 'dd/mm/yyyy') ,21,4, 'Cadeaux'),
( 2 , 150 , TO_DATE( '22/02/2022' , 'dd/mm/yyyy') ,14,2, 'deplacement'),
( 3 , 210 , TO_DATE( '27/06/2021' , 'dd/mm/yyyy') ,2, 3, 'deplacement'),
( 4 , 160 , TO_DATE( '10/12/2021' , 'dd/mm/yyyy') ,6, 2, 'Cadeaux' ),
( 5 , 60 , TO_DATE( '21/09/2021' , 'dd/mm/yyyy') ,8, 5,'nourriture'),
( 6 , 470 , TO_DATE( '22/12/2022' , 'dd/mm/yyyy') ,12,1,'loyer'),
( 7 , 470 , TO_DATE( '27/02/2022' , 'dd/mm/yyyy') ,13,3,'loyer' ),
( 8 , 150 , TO_DATE( '15/01/2022' , 'dd/mm/yyyy') ,20,6, 'deplacement'),
( 9 , 150 , TO_DATE( '27/12/2022' , 'dd/mm/yyyy') ,2, 1, 'vêtement' ),
( 10 , 350 , TO_DATE( '22/12/2022' , 'dd/mm/yyyy'),12,5, 'deplacement'),
( 11 , 20 , TO_DATE( '07/07/2022' , 'dd/mm/yyyy'),5, 5, 'loyer' ),
( 12 , 70 , TO_DATE( '01/11/2022' , 'dd/mm/yyyy'),1, 1,'deplacement'),
( 13 , 70 , TO_DATE( '09/06/2022' , 'dd/mm/yyyy'),22,1, 'deplacement'),
( 14 , 70 , TO_DATE( '09/03/2022' , 'dd/mm/yyyy'),1,3 , 'deplacement'),
( 15 , 50 , TO_DATE( '15/03/2022' , 'dd/mm/yyyy'),1,1 , 'Cadeaux'),
( 16 , 240 , TO_DATE( '10/03/2022' , 'dd/mm/yyyy'),7,1 , 'deplacement'),
( 17 , 105 , TO_DATE( '13/03/2022' , 'dd/mm/yyyy'),1,1 , 'Cadeaux'),
( 18 , 105 , TO_DATE( '07/03/2022' , 'dd/mm/yyyy'),22,1, 'Cadeaux'),
( 19 , 10 , TO_DATE( '01/03/2022' , 'dd/mm/yyyy'),10,1, 'Cadeaux');

 * postgresql://user_tp:***@localhost/ue_bd_ihm_db
19 rows affected.

[]

### Commentaires

In [268]:
%%sql
INSERT INTO commentaire VALUES
( 1 , TO_DATE( '27/07/2022' , 'dd/mm/yyyy') , 'Ramène la coupe à la maison',4, 5,8, 5),
( 2 , TO_DATE( '01/07/2022' , 'dd/mm/yyyy') , 'Il faut payer',15, 4,6, 2 ),
( 3 , TO_DATE( '21/04/2023' , 'dd/mm/yyyy') , 'Jolie dépense', 22,6,12,1 ),
( 4 , TO_DATE( '11/08/2022' , 'dd/mm/yyyy') , 'lol',5,11,5, 5 ),
( 5 , TO_DATE( '01/12/2022' , 'dd/mm/yyyy') , 'Depeche',18,8,20,6 ),
( 6 , TO_DATE( '20/02/2022' , 'dd/mm/yyyy') , 'S il te plait',1,7,13,3 ),
( 7 , TO_DATE( '05/04/2022' , 'dd/mm/yyyy') , 'C est null!',2,12,1, 1 ),
( 8 , TO_DATE( '02/01/2022' , 'dd/mm/yyyy') , 'Ramène la coupe à la maison',2,3,2, 3 ),
( 9 , TO_DATE( '16/02/2022' , 'dd/mm/yyyy') , 'Il faut payer',14,10,12,5 ),
( 10 , TO_DATE( '10/05/2023' , 'dd/mm/yyyy') , 'Jolie dépense',15,2,14,2 ),
( 11 , TO_DATE( '12/02/2023' , 'dd/mm/yyyy') , 'lol',16,1,21,4 ),
( 12 , TO_DATE( '25/11/2022' , 'dd/mm/yyyy') , 'Depeche',12,9,2, 1 ),
( 13 , TO_DATE( '16/01/2023' , 'dd/mm/yyyy') , 'S il te plait',17, 13,22,1),
( 14 , TO_DATE( '22/08/2023' , 'dd/mm/yyyy') , 'C est null!', 17,13,22,1),
( 15 , TO_DATE( '28/01/2023' , 'dd/mm/yyyy') , 'Ramène la coupe à la maison',15, 2,14,2),
( 16 , TO_DATE( '15/02/2023' , 'dd/mm/yyyy') , 'Il faut payer', 10,6,12,1),
( 17 , TO_DATE( '23/06/2023' , 'dd/mm/yyyy') , 'Jolie dépense',2,7,13,3  ),
( 18 , TO_DATE( '26/02/2022' , 'dd/mm/yyyy') , 'lol',19,11,5, 5  ),
( 19 , TO_DATE( '15/01/2023' , 'dd/mm/yyyy') , 'Depeche',19, 11,5, 5 ),
( 20 , TO_DATE( '16/10/2022' , 'dd/mm/yyyy') , 'S il te plait',20, 8,20,6),
( 21 , TO_DATE( '01/05/2023' , 'dd/mm/yyyy') , 'C est null!',4,8,20,6 ),
( 22 , TO_DATE( '23/02/2022' , 'dd/mm/yyyy') , 'Depeche', 16,1,21,4 ),
( 23 , TO_DATE( '22/02/2022' , 'dd/mm/yyyy') , 'Depeche', 14,2,14,2 ),
( 24 , TO_DATE( '26/12/2022' , 'dd/mm/yyyy') , 'Il faut payer', 13,3,2, 3 ),
( 25 , TO_DATE( '10/04/2022' , 'dd/mm/yyyy') , 'Jolie dépense', 15,4,6, 2 ),
( 26 , TO_DATE( '12/04/2022' , 'dd/mm/yyyy') , 'Depeche', 19,5,8, 5 ),
( 27 , TO_DATE( '08/04/2022' , 'dd/mm/yyyy') , 'C est null!',1, 6,12,1 ),
( 28 , TO_DATE( '18/08/2022' , 'dd/mm/yyyy') , 'Jolie dépense', 1,7,13,3),
( 29 , TO_DATE( '11/12/2022' , 'dd/mm/yyyy') , 'S il te plait',15,8,20,6 ),
( 30 , TO_DATE( '27/01/2022' , 'dd/mm/yyyy') , 'Ramène la coupe à la maison', 1,9,2, 1 ),
( 31 , TO_DATE( '03/02/2022' , 'dd/mm/yyyy') , 'C est null!',5, 10,12,5 ),
( 32 , TO_DATE( '18/12/2022' , 'dd/mm/yyyy') , 'Ramène la coupe à la maison',13, 11,5, 5 ),
( 33 , TO_DATE( '21/02/2022' , 'dd/mm/yyyy') , 'Ramène la coupe à la maison',7, 12,1, 1 ),
( 34 , TO_DATE( '13/12/2022' , 'dd/mm/yyyy') , 'Il faut payer',22, 13,22,1 ),
( 35 , TO_DATE( '12/06/2022' , 'dd/mm/yyyy') , 'Depeche', 2,14,1,3  ),
( 36 , TO_DATE( '22/05/2022' , 'dd/mm/yyyy') , 'Ramène la coupe à la maison',22, 15,1,1 ),
( 37 , TO_DATE( '09/10/2022' , 'dd/mm/yyyy') , 'Il faut payer',11, 16,7,1  ),
( 38 , TO_DATE( '22/04/2022' , 'dd/mm/yyyy') , 'Il faut payer',11, 17,1,1  ),
( 39 , TO_DATE( '16/10/2022' , 'dd/mm/yyyy') , 'Depeche',10, 17,1,1  ),
( 40 , TO_DATE( '18/12/2022' , 'dd/mm/yyyy') , 'C est null!',12, 18,22,1),
( 41 , TO_DATE( '21/12/2022' , 'dd/mm/yyyy') , 'Depeche', 22,18,22,1),
( 42 , TO_DATE( '10/06/2022' , 'dd/mm/yyyy') , 'Jolie dépense', 13,10,12,5 ),
( 43 , TO_DATE( '13/03/2022' , 'dd/mm/yyyy') , 'Jolie dépense', 1,12,1, 1 );

 * postgresql://user_tp:***@localhost/ue_bd_ihm_db
43 rows affected.

[]

### Smiley

In [269]:
%%sql
INSERT INTO smiley VALUES
('https://smiley.com/content' ,'content'),
('https://smiley.com/triste'  ,'triste'  ),
('https://smiley.com/mdr'     ,'mdr'     ),
('https://smiley.com/pistolet','pistolet'),
('https://smiley.com/licorne' ,'licorne' );

 * postgresql://user_tp:***@localhost/ue_bd_ihm_db
5 rows affected.

[]

### Réaction

In [270]:
%%sql
insert into reaction values
(13,17,'https://smiley.com/triste',22,13,22,1),
(14,17,'https://smiley.com/pistolet',11,13,22,1),
(18, 19,'https://smiley.com/content', 13,11,5, 5 ),
(18, 19,'https://smiley.com/content', 5,11,5, 5),
(18, 19,'https://smiley.com/content', 3,11,5, 5),
(18, 19,'https://smiley.com/content', 19,11,5, 5),
(4,5, 'https://smiley.com/content',14,11,5, 5),
(30, 1, 'https://smiley.com/content',10,9,2, 1),
(42,13,'https://smiley.com/content',19,10,12,5),
(39,10,'https://smiley.com/pistolet',2, 17,1,1),
(24,13,'https://smiley.com/pistolet',13,3,2, 3),
(24,13,'https://smiley.com/pistolet',2,3,2, 3),
(24,13,'https://smiley.com/pistolet',1,3,2, 3),
(22,16,'https://smiley.com/pistolet',16,1,21,4),
(16,10,'https://smiley.com/pistolet',1,6,12,1);

 * postgresql://user_tp:***@localhost/ue_bd_ihm_db
15 rows affected.

[]

### Remboursement

In [271]:
%%sql
INSERT INTO remboursement VALUES
(6,2,14,2),
(22,6,12,1),
(1,7,13,3),
(3,10,12,5);

 * postgresql://user_tp:***@localhost/ue_bd_ihm_db
4 rows affected.

[]